SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/HTTPServices/Orders/Module.bsl
Функция GetOrdersList(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Представление(Заказы.Ссылка) КАК Referens,
		|	Заказы.Номер КАК Number,
		|	Заказы.Дата КАК Date,
		|	Представление(Заказы.Официант) КАК Employee,
		|	Представление(Заказы.Ресторан) КАК Restourant,
		|	Заказы.Итого КАК Summary,
		|	Представление(Заказы.Клиент) КАК Client,
		|	Представление(Заказы.Доставка) КАК Delivery,
		|	Представление(Заказы.Курьер) КАК courier,
		|	Представление(Заказы.ДатаЗакрытияЗаказа) КАК CloseDate
		|ИЗ
		|	Документ.Заказы КАК Заказы";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	МассивРезультатов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура("Referens, Number, Date, Employee, Restourant, Summary, Client, Delivery, courier, CloseDate");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		МассивРезультатов.Добавить(Структура);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивРезультатов);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.ANSI);

	
	
	
	Возврат Ответ;
КонецФункции

Функция GetOrdersListGetOrder(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

//Функция GetOrdersListGetOrder(Запрос)
//	Ответ = Новый HTTPСервисОтвет(200);
//	
//	Возврат Ответ;
//КонецФункции
